---
kind: other
id: Properties.T:Autodesk.Revit.DB.FilterStringEndsWith
source: html/36481160-9ea9-092e-6699-8404783349f0.htm
---
# FilterStringEndsWith Properties

Specifies whether the .NET object represents a valid Revit entity.